app/controllers/main_controller.rb

SELECT "ds_elements".* FROM "ds_elements" ORDER BY "ds_elements"."fullpath" ASC
---
	def index
		@elements = DsElement.all.order(:fullpath)

INSERT INTO "ds_elements" ("created_at", "fullpath", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 06 Mar 2014 18:40:29 UTC +00:00], ["fullpath", "interaction.source"], ["updated_at", Thu, 06 Mar 2014 18:40:29 UTC +00:00]]
SELECT "ds_elements".* FROM "ds_elements" WHERE "ds_elements"."fullpath" = 'interaction.source' ORDER BY "ds_elements"."id" ASC LIMIT 1
UPDATE "ds_elements" SET "prop" = ?, "updated_at" = ? WHERE "ds_elements"."id" = 48  [["prop", "source"], ["updated_at", Thu, 06 Mar 2014 18:43:55 UTC +00:00]]
---
	def webhook
		#if params[:token] == ENV['SIMPLE_TOKEN']
			if params[:interactions]
				params[:interactions].each do |iac|
					output = flatten_with_path(iac)
					#puts output.to_yaml
					output.each do |i, v|
						#puts "#{i} : #{v} (#{get_datatype(v)})"
						if !i.include?"http"
							target = i
							#target = i.gsub(".0",".").gsub("..",".")
							elem = DsElement.find_or_create_by(fullpath: target)
							if elem.prop == nil
								elem.prop = target.split(".")[-1]
							end
							if elem.datatype == nil or elem.datatype == ""
								elem.datatype = get_datatype(v) #rescue nil
							end
							if v != nil and v != ""
								elem.last_value = v.to_s rescue "[nested]"
							end
							if elem.changed?
								elem.save